
#Область ПрограммныйИнтерфейс

// Установить признак заполнености ячейки.
// 
// Параметры:
//  Ячейка - СправочникСсылка.уатСкладскиеЯчейки - Ячейка
//  Заполнено - Булево - Заполнено
// Возвращаемое значение:
// 	Булево - Признак заполнености
Функция УстановитьПризнакЗаполненностиЯчейки(Ячейка, Заполнено) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"SUAT_СкладскиеЯчейки.УстановитьПризнакЗаполненностиЯчейки", "Ячейка", Ячейка, 
		Тип("СправочникСсылка.уатСкладскиеЯчейки"));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"SUAT_СкладскиеЯчейки.УстановитьПризнакЗаполненностиЯчейки", "Заполнено", Заполнено, Тип("Булево"));
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не Ячейка.Пустая(), 
		НСтр("ru = 'Передана пустая ссылка ячейки'"));
	
	ЯчейкаОбъект = Ячейка.ПолучитьОбъект();
	ЯчейкаОбъект.SUAT_Заполнено = Заполнено;
	
	ЯчейкаОбъект.Записать();
	
	Возврат ЯчейкаОбъект.SUAT_Заполнено;
	
КонецФункции

#КонецОбласти
