
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура SUAT_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	SUAT_ОприходыватьТолькоПоГлавномуАналогу = SUAT_АналогиНоменклатуры.ОприходыватьТолькоПоГлавномуАналогу();
	
КонецПроцедуры

&НаКлиенте
Процедура SUAT_ПриОткрытииПосле(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) <> Тип("ФормаКлиентскогоПриложения") Или
		Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВладелецФормы, "Объект") Или
		Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВладелецФормы.Объект, "Ссылка") Или
		ТипЗнч(ВладелецФормы.Объект.Ссылка) <> Тип("ДокументСсылка.уатПоступлениеТоваровУслуг") Тогда
		
		SUAT_ОприходыватьТолькоПоГлавномуАналогу = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры
&НаКлиенте
Процедура SUAT_СписокНоменклатурыПриАктивизацииСтрокиПосле(Элемент)
	
	Если SUAT_ОприходыватьТолькоПоГлавномуАналогу Тогда
		
		ОтборСтрокАналогиНоменклатуры = Новый Структура();
		ОтборСтрокАналогиНоменклатуры.Вставить("Главный", Истина);
		
		Если Элементы.АналогиНоменклатуры.ОтборСтрок <> Неопределено Тогда
			
			Для Каждого ЭлементОтбораСтрок Из Элементы.АналогиНоменклатуры.ОтборСтрок Цикл
				
				Если ЭлементОтбораСтрок.Ключ <> "Главный" Тогда
					ОтборСтрокАналогиНоменклатуры.Вставить(ЭлементОтбораСтрок.Ключ, ЭлементОтбораСтрок.Значение);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Элементы.АналогиНоменклатуры.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрокАналогиНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
