
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура SUAT_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	SUAT_ИнициализироватьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура SUAT_ИнициализироватьЭлементыФормы()
	
	ГруппаФормы_SimpleUAT = Элементы.Найти("ГруппаSimpleUAT");
	
	Если ГруппаФормы_SimpleUAT = Неопределено Тогда
		
		ГруппаСоставаГруппы = Элементы.Найти("ГруппаСоставаГруппы");
		
		ГруппаФормы_SimpleUAT = Элементы.Вставить("ГруппаОбычная", Тип("ГруппаФормы"), ЭтотОбъект, ГруппаСоставаГруппы);
		ГруппаФормы_SimpleUAT.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		//@skip-check bsl-legacy-check-expression-type
		ГруппаФормы_SimpleUAT.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаФормы_SimpleUAT.ОтображатьЗаголовок = Ложь; 
		
	КонецЕсли;
	
	ЭлементФормы_ГабаритностьМатериала = Элементы.Найти("SUAT_ГабаритностьМатериала");
	
	Если ЭлементФормы_ГабаритностьМатериала = Неопределено Тогда
		
		ЭлементФормы_ГабаритностьМатериала = Элементы.Добавить(
			"SUAT_ГабаритностьМатериала", Тип("ПолеФормы"), ГруппаФормы_SimpleUAT);
		ЭлементФормы_ГабаритностьМатериала.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы_ГабаритностьМатериала.ПутьКДанным = "Объект.SUAT_ГабаритностьМатериала";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
